

def Info_tab():
    st.title("Πληροφορίες για την εφαρμογή")
    st.markdown("## Γενικές Πληροφορίες Εφαρμογής")
    st.write("Η συγκεκριμένη εφαρμογή χρησιμοποιείται για την εξόρυξη και ανάλυση δεδομένων, με χρήση του Streamlit. Υποστηρίζει διάφορες λειτουργίες όπως η φόρτωση δεδομένων, προδιαγραφές DataFrame, 2D οπτικοποιήσεις βασισμένες σε διαφορετικούς αλγορίθμους και μηχανική μάθηση.")
    st.write("Για να χρησιμοποιήσετε την εφαρμογή, απλά ανεβάστε τα δεδομένα σας σε μορφή CSV ή Excel, και στη συνέχεια επιλέξτε την επιθυμητή λειτουργία από τις επιλογές στο αριστερό μέρος: DataFrame_tab, Visualization_tab, Machine_Learning_tab, ή Info_tab, η κάθε μία εκτελεί διαφορετική λειτουργία.")
    
    st.markdown("### Πώς να τη χρησιμοποιήσετε;")
    st.write("Η χρήση της εφαρμογής είναι απλή και κατανοητή από όλους. Εδώ έχουμε μια αναλυτική εξήγηση:")
    st.markdown("- **DataFrame:** Επιτρέπει στον χρήστη να δει το σύνολο δεδομένων με ή χωρίς ετικέτες, και να το κλείσει μετά την επισκόπηση.")
    st.markdown("- **Visualization:** Ο χρήστης μπορεί να εκτελέσει 2D οπτικοποιήσεις χρησιμοποιώντας PCA ή t-SNE, μαζί με διαγράμματα ανάλυσης δεδομένων (EDA) όπως ιστόγραμμα, διάγραμμα πυκνότητας, και διάγραμμα Boxplot.")
    st.markdown("- **Machine Learning:** Ο χρήστης μπορεί να εφαρμόσει και να συγκρίνει αλγορίθμους μηχανικής μάθησης για ταξινόμηση (Support Vector Machines, K-Nearest Neighbors) και ομαδοποίηση (Agglomerative Clustering, Affinity Propagation). Πρέπει να παρέχει τιμές για τις μεταβλητές του κάθε αλγορίθμου.")
    st.markdown("- **Info:** Παρέχει γενικές πληροφορίες για την εφαρμογή, την ομάδα ανάπτυξης, και τα tasks που έχει ολοκληρώσει κάθε μέλος της ομάδας.")
    
    st.markdown("## Μέλη της Ομάδας")
    st.write("Η ομάδα ανάπτυξης αποτελείται από τους Νικόλαο Αναγνωστόπουλο, Αχιλλέα Ζερβό, και Παναγιώτη Μουρελάτο, φοιτητές στο Ιόνιο Πανεπιστήμιο.")
    
    st.markdown("## Εργασίες που ολοκληρώθηκαν από κάθε μέλος")
    st.write("- **DataFrame:** Νικόλαος Αναγνωστόπουλος (ΑΜ: inf2021013)")
    st.write("- **Visualization:** Αχιλλέας Ζερβός (ΑΜ: inf2021055)")
    st.write("- **Machine Learning:** Νικόλαος Αναγνωστόπουλος (ΑΜ: inf2021013)")
    st.write("- **Info:** Παναγιώτης Μουρελάτος (ΑΜ: inf2021147)")
  
